def max_of_three(num1, num2, num3):
    a=(num1, num2, num3)
    return max(a)


num1=input()
num2=input()
num3=input()
print(max_of_three(num1, num2, num3))

# Задача:
# Создайте функцию, принимающую на вход 3 числа и возвращающую наибольшее из них.
